---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RoomFailures.RoomNotEnclosedAreas
source: html/245e503c-8614-16d2-cbe5-6ae350d06c40.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RoomFailures.RoomNotEnclosedAreas Property

[Room] is not in a properly enclosed region

## Syntax (C#)
```csharp
public static FailureDefinitionId RoomNotEnclosedAreas { get; }
```